; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v7)
             (pred_6 ?v12 ?v5)
             (pred_12 ?v13 ?v5)
             (pred_1 ?v9 ?v13 )
	     (pred_4 ?v13)
             (pred_3 ?v2)
             (pred_8 ?v12)
             (pred_10 ?v5)
             (pred_5 ?v13)
             (pred_9 ?v12)
             (pred_11 ?v13)
             (pred_7 ))



(:action op_1
:parameters (?v1 ?v10 ?v11 ?v4)
:precondition (and (pred_3 ?v1) (pred_3 ?v10) (pred_8 ?v11) (pred_10 ?v4)
          (pred_2 ?v1 ?v10) (pred_6 ?v11 ?v4)
                   (pred_12 ?v10 ?v4) (pred_4 ?v1) 
                   (pred_5 ?v10) (pred_9 ?v11))
:effect (and  (pred_11 ?v10) (not (pred_5 ?v10))))


(:action op_3
:parameters (?v1 ?v3)
:precondition (and (pred_3 ?v1) (pred_3 ?v3)
               (pred_4 ?v1) (pred_2 ?v1 ?v3) (pred_11 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v1))))

(:action op_4
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_8 ?v11) 
                  (pred_4 ?v1) (pred_1 ?v11 ?v1) (pred_7 ))
:effect (and (pred_9 ?v11)
   (not (pred_1 ?v11 ?v1)) (not (pred_7 ))))


(:action op_2
:parameters (?v1 ?v6 ?v8)
:precondition (and (pred_3 ?v1) (pred_8 ?v6) (pred_8 ?v8)
                  (pred_4 ?v1) (pred_9 ?v8) (pred_1 ?v6 ?v1))
:effect (and (pred_9 ?v6) (pred_1 ?v8 ?v1)
        (not (pred_9 ?v8)) (not (pred_1 ?v6 ?v1))))

(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_8 ?v11) 
                  (pred_4 ?v1) (pred_9 ?v11))
:effect (and (pred_7 ) (pred_1 ?v11 ?v1) (not (pred_9 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_02 obj_24 obj_03 obj_06 obj_28 obj_05 obj_22 obj_18 obj_19 obj_30 obj_04 obj_16 obj_15 obj_21 obj_29 obj_20 obj_27 obj_11 obj_26 obj_07 obj_17 obj_25 obj_13 obj_10
    obj_12 obj_14
    obj_23 obj_09 obj_08
    )

    (:init
       (pred_7)

       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_24)
       (pred_3 obj_03)
       (pred_3 obj_06)
       (pred_3 obj_28)
       (pred_3 obj_05)
       (pred_3 obj_22)
       (pred_3 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_30)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_15)
       (pred_3 obj_21)
       (pred_3 obj_29)
       (pred_3 obj_20)
       (pred_3 obj_27)
       (pred_3 obj_11)
       (pred_3 obj_26)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_25)
       (pred_3 obj_13)
       (pred_3 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_14)
       (pred_8 obj_23)
       (pred_8 obj_09)
       (pred_8 obj_08)

       (pred_2 obj_01 obj_28)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_02 obj_05)
       (pred_2 obj_02 obj_24)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_24 obj_22)
       (pred_2 obj_24 obj_03)
       (pred_2 obj_24 obj_02)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_03 obj_24)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_28 obj_30)
       (pred_2 obj_28 obj_05)
       (pred_2 obj_28 obj_01)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_22)
       (pred_2 obj_05 obj_02)
       (pred_2 obj_05 obj_28)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_22 obj_18)
       (pred_2 obj_22 obj_24)
       (pred_2 obj_22 obj_05)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_18 obj_22)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_30 obj_29)
       (pred_2 obj_30 obj_04)
       (pred_2 obj_30 obj_28)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_30)
       (pred_2 obj_16 obj_27)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_15 obj_11)
       (pred_2 obj_15 obj_21)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_21 obj_26)
       (pred_2 obj_21 obj_19)
       (pred_2 obj_21 obj_15)
       (pred_2 obj_29 obj_07)
       (pred_2 obj_29 obj_20)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_27)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_29)
       (pred_2 obj_27 obj_25)
       (pred_2 obj_27 obj_11)
       (pred_2 obj_27 obj_16)
       (pred_2 obj_27 obj_20)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_26)
       (pred_2 obj_11 obj_15)
       (pred_2 obj_11 obj_27)
       (pred_2 obj_26 obj_10)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_26 obj_11)
       (pred_2 obj_07 obj_17)
       (pred_2 obj_07 obj_29)
       (pred_2 obj_17 obj_25)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_07)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_25 obj_27)
       (pred_2 obj_25 obj_17)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_10 obj_26)
       (pred_2 obj_10 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_26)
       (pred_5 obj_25)
       (pred_12  obj_05 obj_12)
       (pred_12  obj_26 obj_14)
       (pred_12  obj_25 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_02)
       (pred_11 obj_24)
       (pred_11 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_28)
       (pred_11 obj_22)
       (pred_11 obj_18)
       (pred_11 obj_19)
       (pred_11 obj_30)
       (pred_11 obj_04)
       (pred_11 obj_16)
       (pred_11 obj_15)
       (pred_11 obj_21)
       (pred_11 obj_29)
       (pred_11 obj_20)
       (pred_11 obj_27)
       (pred_11 obj_11)
       (pred_11 obj_07)
       (pred_11 obj_17)
       (pred_11 obj_13)
       (pred_11 obj_10)

       (pred_6  obj_23 obj_12)
       (pred_6  obj_09 obj_14)
       (pred_6  obj_08 obj_12)
       (pred_1 obj_23 obj_21)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_08 obj_20)
       (pred_4 obj_02)
    )

    (:goal (and
       (pred_1 obj_23 obj_18)
       (pred_1 obj_09 obj_29)
       (pred_1 obj_08 obj_19)
    ))
(:constraints
  (always (not (pred_4 obj_15)))
)
)

; plan
1. (op_3 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_01)
   goals met: 0 of 3
2. (op_3 obj_01 obj_28)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_28)
   goals met: 0 of 3
3. (op_3 obj_28 obj_30)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_30)
   goals met: 0 of 3
4. (op_3 obj_30 obj_29)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_29)
   goals met: 0 of 3
5. (op_3 obj_29 obj_20)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_20)
   goals met: 0 of 3
6. (op_4 obj_20 obj_08)
   deleted: (pred_1 obj_08 obj_20) (pred_7)
   added: (pred_9 obj_08)
   goals met: 0 of 3
7. (op_3 obj_20 obj_04)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_04)
   goals met: 0 of 3
8. (op_3 obj_04 obj_16)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_16)
   goals met: 0 of 3
9. (op_3 obj_16 obj_22)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_22)
   goals met: 0 of 3
10. (op_3 obj_22 obj_18)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_18)
   goals met: 0 of 3
11. (op_3 obj_18 obj_19)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_19)
   goals met: 0 of 3
12. (op_5 obj_19 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_7) (pred_1 obj_08 obj_19)
   goals met: 1 of 3
13. (op_3 obj_19 obj_21)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_21)
   goals met: 1 of 3
14. (op_4 obj_21 obj_23)
   deleted: (pred_1 obj_23 obj_21) (pred_7)
   added: (pred_9 obj_23)
   goals met: 1 of 3
15. (op_3 obj_21 obj_19)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_19)
   goals met: 1 of 3
16. (op_3 obj_19 obj_18)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_18)
   goals met: 1 of 3
17. (op_5 obj_18 obj_23)
   deleted: (pred_9 obj_23)
   added: (pred_7) (pred_1 obj_23 obj_18)
   goals met: 2 of 3
18. (op_3 obj_18 obj_03)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_03)
   goals met: 2 of 3
19. (op_4 obj_03 obj_09)
   deleted: (pred_1 obj_09 obj_03) (pred_7)
   added: (pred_9 obj_09)
   goals met: 2 of 3
20. (op_3 obj_03 obj_24)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_24)
   goals met: 2 of 3
21. (op_3 obj_24 obj_02)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_02)
   goals met: 2 of 3
22. (op_3 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_01)
   goals met: 2 of 3
23. (op_3 obj_01 obj_28)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_28)
   goals met: 2 of 3
24. (op_3 obj_28 obj_30)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_30)
   goals met: 2 of 3
25. (op_3 obj_30 obj_29)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_29)
   goals met: 2 of 3
26. (op_5 obj_29 obj_09)
   deleted: (pred_9 obj_09)
   added: (pred_7) (pred_1 obj_09 obj_29)
   goals met: 3 of 3
